Revit 2024 API
BuiltInFailures.GeneralFailures.FailedToReadLine Property
 Failed to read line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FailedToReadLine { get; }
Visual Basic
Public Shared ReadOnly Property FailedToReadLine As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FailedToReadLine {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace